src/InformationRegisters/СтатусыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СтатусыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СтатусыНоменклатуры/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Устанавливает статус продажи номенклатуры
//
Процедура УстановитьСтатусПродажиНоменклатуры(СтруктурнаяЕдиница, Номенклатура, Знач ДатаСтатуса, Знач ВПродаже, СтруктураСтатус = Неопределено) Экспорт
	
	Если СтруктураСтатус = Неопределено Тогда 
		СтруктураСтатус = ПолучитьСтатусПродажиНоменклатуры(СтруктурнаяЕдиница, Номенклатура, ДатаСтатуса);
	КонецЕсли;	
	Если НЕ СтруктураСтатус.ЕстьСтатус Тогда
		НовыйСтатус = РегистрыСведений.СтатусыНоменклатуры.СоздатьМенеджерЗаписи();
		НовыйСтатус.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		НовыйСтатус.Номенклатура = Номенклатура;
		НовыйСтатус.Период = ДатаСтатуса;
		НовыйСтатус.ВПродаже = ВПродаже;
		НовыйСтатус.Записать();	
	ИначеЕсли СтруктураСтатус.ВПродаже <> ВПродаже Тогда
		НовыйСтатус = РегистрыСведений.СтатусыНоменклатуры.СоздатьМенеджерЗаписи();
		НовыйСтатус.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		НовыйСтатус.Номенклатура = Номенклатура;
		НовыйСтатус.Период = ДатаСтатуса;
		НовыйСтатус.ВПродаже = ВПродаже;
		НовыйСтатус.Записать();		
	КонецЕсли;
		
КонецПроцедуры

// Функция получает статус продажи номенклатуры
//
Функция ПолучитьСтатусПродажиНоменклатуры(СтруктурнаяЕдиница, Номенклатура, Знач ДатаСтатуса) Экспорт
	
	ЗапросСтатус = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                            |	СтатусыНоменклатурыСрезПоследних.Период,
	                            |	СтатусыНоменклатурыСрезПоследних.ВПродаже
	                            |ИЗ
	                            |	РегистрСведений.СтатусыНоменклатуры.СрезПоследних(
	                            |			&ДатаСреза,
	                            |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	                            |				И Номенклатура = &Номенклатура) КАК СтатусыНоменклатурыСрезПоследних");
	
	ЗапросСтатус.УстановитьПараметр("ДатаСреза", ДатаСтатуса);
	ЗапросСтатус.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	ЗапросСтатус.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатСтатус = ЗапросСтатус.Выполнить().Выбрать();
	
	Если РезультатСтатус.Следующий() Тогда
		ВПродаже = РезультатСтатус.Впродаже;
		ДатаСтатуса = РезультатСтатус.Период;
		ЕстьСтатус = Истина;
	Иначе
		ВПродаже = Истина;
		ДатаСтатуса = Дата(1,1,1);
		ЕстьСтатус = Ложь;
	КонецЕсли;	
	
	СтруктураВозврата = Новый Структура("ВПродаже, ДатаСтатуса, ЕстьСтатус", ВПродаже, ДатаСтатуса, ЕстьСтатус);
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти
